{
  "main": {
    "name":"Joy Chen",
    "description":"software developer. I'm a current UNC Coding Bootcamp student who will finish in August 2020. I use ReactJS and JavaScript to develop applications. This website serves as a testimony to my skills",
    "image":"profile.png",
    "bio":"As a personable and tech-savvy web developer with a background in customer and public service, I am driven towards technological advances. I have a Full-Stack certification from the University of North Carolina-Chapel HIll. During the intense six month boot camp, I gained skills in JavaScript, jQuery, SQL, Mongoose, CSS, HTML, Node.js, Express, ReactJS and much more. I am constantly striving to advance my education and technological knowledge as well as continuously problem solve. I am looking to bring my attention to detail, hunger for knowledge, and technical skills to a company to grow and become a valuable asset.",
    "contactmessage":"If you're interested in working with me, send me a message down below and I'll get back to you as soon as possible. I look forward to hearing from you!",
    "email": "joychen5069@gmail.com",
    "phone": "919-448-4416",
    "LinkedIn":"https://www.linkedin.com/in/joy-chen-5069/", 
    "github":"https://github.com/joychen5069",
    "address":{
      "street":"706 Northampton Dr",
      "city":"Cary",
      "state":"North Carolina",
      "zip": "27513"
    },
    "website": "https://joy-chen-portfolio.herokuapp.com/",
    "resumedownload":"JoyChenResume.pdf",
    "social":[
      {
        "name":"linkedin",
        "url":"https://www.linkedin.com/in/joy-chen-5069/",
        "className":"fa fa-linkedin"
      },
      {
        "name":"github",
        "url":"https://github.com/joychen5069",
        "className":"fa fa-github"
      }
    ]
  },
  "resume":{
    "skillmessage":"Just a quick screenshot of my abilities!",
    "education":[
      {
        "school":"University of North Carolina-Chapel Hill",
        "degree":"Certificate - Full Stack Web FLex Development",
        "graduated":"August 2020",
        "description":"An intensive Full Stack program that taught technical programming skills in computer science including front-end and back-end development, server-side dvelopment, database interaction, and live deployments"
      },
      {
        "school":"University of North Carolina-Chapel Hill",
        "degree":"BA in Peace, War, and Defense",
        "graduated":"May 2017",
        "description":"A four year degree in the studies of national and international security and relations with a strong focus in modern warfare."
      }
    ],
    "work":[
      
      {
        "company":"COVID-19 Tracker",
        "title":"Full-Stack Developer",
        "years":"July 2020 - Present",
        "description":"This project requires the user to create an account in order to access the site. After the user creates an account, they are able to choose their location on the map and see how many current COVID cases their county has. This application also contains a symptom checker that will provide a triage level and assist in helping the user choose the next step if they possibly have COVID. This application is powered through React.JS, jquery, bootstrap, and APIS from Azure News, Infermedica, and NY Times.",
        "url":"https://covid19-tracker-applicaiton.herokuapp.com/",
        "github": "https://github.com/traviscult/project-3"
      },
      {
        "company":"Book Club",
        "title":"Full-Stack Developer",
        "years":"May 2020 - June 2020",
        "description":"This application allows you to find a book club to join depending on your reading interests. The project is powered by JavaScript, AJAX API calls, NodeJS, and SQL. Feel free to checkout the demo",
        "url":"https://book-club-application.herokuapp.com/",
        "github": "https://github.com/joychen5069/BookClub"
      }
    ],
    "skills":[
      {
        "name":"JavaScript/jQuery",
        "link":"fas fa-code"
      },
     {
        "name":"ReactJs",
        "link":"fas fa-sitemap"
      },
      {
        "name":"HTML/CSS",
        "link":"fas fa-laptop-code"
      },
      {
        "name":"NodeJS",
        "link":"fas fa-code-branch"
      },
      {
        "name":"Mongo/SQL",
        "link":"fas fa-database"
      },
      {
        "name":"Public Safety",
        "link":"fas fa-shield-alt"
      },
      {
        "name":"Customer Service",
        "link":"fas fa-users"
      }
    ]
  },
  "portfolio":{
    "projects": [
      {
        "title":"Date Night",
        "category":"This project allows the user to choose a cuisine and alcohol type to find a food pairing. The website will give you a completed picture of what the meal and drink should look like, the ingredient list, and the instructions on how to make the meal.",
        "image":"DateNight.png",
        "url":"https://joychen5069.github.io/Date-Night/",
        "github":"https://github.com/joychen5069/Date-Night"
      },
      
      {
        "title":"Workout Tracker",
        "category":"This application will assist you in keeping track of your workouts! If you love cardio and/or resistance training, this is the application for you. It will assist you in tracking the weight, the reps, the sets, the duration, and the milage you put in.",
        "image":"WorkoutTracker.png",
        "url":"https://workout-tracker-by-joy.herokuapp.com/",
        "github":"https://github.com/joychen5069/WorkoutTracker"
      },    
      {
        "title":"Online Offline Budget Tracker",
        "category":"This application will assist you in keeping track of your expenses when you have internet and when you don't! The offline feature is extremely helpful for when users are in areas where the internet is sparse or super expensive and just not worth connecting to.",
        "image":"budget.png",
        "url":"https://online-offline-budget.herokuapp.com/",
        "github":"https://github.com/joychen5069/OnlineOfflineBudgetTracker"
      }, 
      {
        "title":"Note Taker",
        "category":"Everyone takes notes. Whether they scrible it down on a piece of paper, or quickly type on their phone, or even open a notepad document on their computer. Here is how to store all of those notes in one place!",
        "image":"NoteTaker.png",
        "url":"https://joynotetaker.herokuapp.com/",
        "github":"https://github.com/joychen5069/NoteTaker"
      },     
      {
        "title":"Weather Application",
        "category":"I have created a weather application that gives you the information you need to step out the door and go on an adventure! he application will give you the current temperature, humidity, wind speed, and the UV index with a color code. It'll even give you an icon for what the majority of the day should be like!",
        "image":"Weather-Api.png",
        "url":"https://joychen5069.github.io/WeatherForcast/",
        "github":"https://github.com/joychen5069/WeatherForcast"
      },
        
      {
        "title":"Password Generator",
        "category":"No one wants a super predictable and easy-to-guess password. Everyone has their own reasons to keep their belongings, thoughts, work, and etc. safe! Like all other passwords, this one has requirements. This application allows the user to choose parameters in which the program will create a password.",
        "image":"passwordGenerator.jpg",
        "url":"https://joychen5069.github.io/RandomPasswordGenerator/",
        "github":"https://github.com/joychen5069/RandomPasswordGenerator"
      }
      
    ]
  }
}
